# StringerCurveTooShort Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..StringerCurveTooShort Property
BuiltInFailures..::..StairRampFailures Class See Also
---
A piece of boundary is too short to create stringer on it.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StringerCurveTooShort { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StringerCurveTooShort As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StringerCurveTooShort {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace